[
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [
        {
          "kind": "t3",
          "data": {
            "domain": "self.Bitcoin",
            "banned_by": null,
            "media_embed": {},
            "subreddit": "Bitcoin",
            "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;do not be afraid. whatever you do, always remember to keep your peace. the world may be falling apart all around you, and you think that life won&amp;#39;t continue on if you do not complete these self imposed tasks. i promise you the natural course of things will continue. there is more than enough to go around and feed not only the world, and all of her inhabitants. think about the blessing we&amp;#39;ve been gifted. that of remembering things. let&amp;#39;s remember what it&amp;#39;s like to of not had to in the first place. only a peace in ones heart among all of earths inhabitants at once. what a gloryful sight. sadly the bitter reality is that life continues on once you&amp;#39;re gone. for all you know, this is your life, and it counts. governments can&amp;#39;t complain if everyone gets into prayer all at once, and all around there&amp;#39;s peace. all nations should keep it in their moral interest to not want to kill citizens of a planet we all live on. i call for the disarmament of all nations. I am not the antichrist, of the one in a King&amp;#39;s James Bible. I am a sovereign human asking for permission from my consciousness, the one i have chosen to label &amp;quot;government&amp;quot;. The grievances are enormous. Collectively as a history, in the last hundred years, have been absolutely horrible to potentially die of non-natural causes. The intensity is starting to ramp up, and to be honest I&amp;#39;m quite sick of it. I think that humans all around the world should unite, praise our virtues, and live in peace. If you someone in the military, and you justify killing other humans for a fictitious profit in your bank account, we collectively want you to know that what we think you do is wrong, and should consider stop doing it. You should live with the rest of us humans who just want to live, and not be pestered by the prospect of spending any amount of it warehoused in close proximity to others being warehoused. this is a disgrace to of had come to the conclusion, that because one is wicked in heart, we should inflict more wickedness upon us. Is this what Jesus of Nazareth taught? No, he taught to turn the other cheek. As an American, I think I justly deserve the opportunity to speak freely to the world at this time. As a citizen, I am not pleased with what my government has done. We commit atrocities all across the world, in the name of some economic function that was designed to separate and create another layer of illusion between us. The emerging generation that is coming through is a lot more conscientious and truly capable of saving the world from anywhere you are. And if there&amp;#39;s only one thing, you should ever try and do, it&amp;#39;d be to, and this by the way is not exclusive to to any &amp;quot;class&amp;quot;, the poor and the rich can participate, and that is to make someone else happy, everyday. your life will change. you lighten up. you&amp;#39;ll shine really brightly. everyone will see you. you will be thriving. you will see everyone. just like you. thriving. If you&amp;#39;re a citizen of another country that isn&amp;#39;t the &amp;quot;United States of America&amp;quot;, I want you to know that we love you. We really, really, really do. We don&amp;#39;t believe the official story of what really happened on 09/11/01. If something really crazy disastrous event were to happen, and it was later found out that we were the perpetrators in a chase for Earth&amp;#39;s Natural Resources, I want you to know that as a citizen, it deeply saddens me that people have to die. We don&amp;#39;t have that much hatred in our hearts to commit these acts. Our elections are bought and paid for by the &amp;quot;rich and powerful&amp;quot;, and we lost the integrity of our government all together. We want to start a revolution. We&amp;#39;ll start in our hearts. I am only one person. I have personally been responsible for things that I am deeply ashamed of, and if you knew what they were you probably wouldn&amp;#39;t like me at all. I am taking enormous &amp;quot;social risk&amp;quot; by even posting this. &amp;quot;But then again that&amp;#39;s just my brain talkin&amp;quot;, but this is serious. If someone could help me translate this message in every language, and document, that at one point in history, we humans really had to fight imaginations of separateness. When you harm another, you harm yourself. We&amp;#39;re trying very hard over here to change things, but we&amp;#39;re too occupied with our jobs, to give us a sense of worth. Do I believe in Bitcoin? Yes. It&amp;#39;s an alternate to the current paradigm. Think of how many happy people, will spend their money, if you knew it&amp;#39;d make them rich. We could end world hunger. We could be better and better everyday. It&amp;#39;s okay to make mistakes. Learn that&amp;#39;s what they are, and continue to love yourself. We&amp;#39;re hardest on ourselves, and not in the &amp;quot;We&amp;#39;re hardest on ourselves, we say &amp;quot;we&amp;#39;re hardest on ourselves&amp;quot;, just to say &amp;quot;we&amp;#39;re hardest on ourselves&amp;quot;. We represent an emerging paradigm. One of love. Remember to love.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
            "selftext": "do not be afraid. whatever you do, always remember to keep your peace. the world may be falling apart all around you, and you think that life won't continue on if you do not complete these self imposed tasks. i promise you the natural course of things will continue. there is more than enough to go around and feed not only the world, and all of her inhabitants. think about the blessing we've been gifted. that of remembering things. let's remember what it's like to of not had to in the first place. only a peace in ones heart among all of earths inhabitants at once. what a gloryful sight. sadly the bitter reality is that life continues on once you're gone. for all you know, this is your life, and it counts. governments can't complain if everyone gets into prayer all at once, and all around there's peace. all nations should keep it in their moral interest to not want to kill citizens of a planet we all live on. i call for the disarmament of all nations. I am not the antichrist, of the one in a King's James Bible. I am a sovereign human asking for permission from my consciousness, the one i have chosen to label \"government\". The grievances are enormous. Collectively as a history, in the last hundred years, have been absolutely horrible to potentially die of non-natural causes. The intensity is starting to ramp up, and to be honest I'm quite sick of it. I think that humans all around the world should unite, praise our virtues, and live in peace. If you someone in the military, and you justify killing other humans for a fictitious profit in your bank account, we collectively want you to know that what we think you do is wrong, and should consider stop doing it. You should live with the rest of us humans who just want to live, and not be pestered by the prospect of spending any amount of it warehoused in close proximity to others being warehoused. this is a disgrace to of had come to the conclusion, that because one is wicked in heart, we should inflict more wickedness upon us. Is this what Jesus of Nazareth taught? No, he taught to turn the other cheek. As an American, I think I justly deserve the opportunity to speak freely to the world at this time. As a citizen, I am not pleased with what my government has done. We commit atrocities all across the world, in the name of some economic function that was designed to separate and create another layer of illusion between us. The emerging generation that is coming through is a lot more conscientious and truly capable of saving the world from anywhere you are. And if there's only one thing, you should ever try and do, it'd be to, and this by the way is not exclusive to to any \"class\", the poor and the rich can participate, and that is to make someone else happy, everyday. your life will change. you lighten up. you'll shine really brightly. everyone will see you. you will be thriving. you will see everyone. just like you. thriving. If you're a citizen of another country that isn't the \"United States of America\", I want you to know that we love you. We really, really, really do. We don't believe the official story of what really happened on 09/11/01. If something really crazy disastrous event were to happen, and it was later found out that we were the perpetrators in a chase for Earth's Natural Resources, I want you to know that as a citizen, it deeply saddens me that people have to die. We don't have that much hatred in our hearts to commit these acts. Our elections are bought and paid for by the \"rich and powerful\", and we lost the integrity of our government all together. We want to start a revolution. We'll start in our hearts. I am only one person. I have personally been responsible for things that I am deeply ashamed of, and if you knew what they were you probably wouldn't like me at all. I am taking enormous \"social risk\" by even posting this. \"But then again that's just my brain talkin\", but this is serious. If someone could help me translate this message in every language, and document, that at one point in history, we humans really had to fight imaginations of separateness. When you harm another, you harm yourself. We're trying very hard over here to change things, but we're too occupied with our jobs, to give us a sense of worth. Do I believe in Bitcoin? Yes. It's an alternate to the current paradigm. Think of how many happy people, will spend their money, if you knew it'd make them rich. We could end world hunger. We could be better and better everyday. It's okay to make mistakes. Learn that's what they are, and continue to love yourself. We're hardest on ourselves, and not in the \"We're hardest on ourselves, we say \"we're hardest on ourselves\", just to say \"we're hardest on ourselves\". We represent an emerging paradigm. One of love. Remember to love.",
            "likes": null,
            "user_reports": [],
            "secure_media": null,
            "link_flair_text": null,
            "id": "2i9f10",
            "gilded": 0,
            "secure_media_embed": {},
            "clicked": false,
            "report_reasons": null,
            "author": "pimpingken",
            "media": null,
            "score": 0,
            "approved_by": null,
            "over_18": false,
            "hidden": false,
            "thumbnail": "self",
            "subreddit_id": "t5_2s3qj",
            "edited": false,
            "link_flair_css_class": null,
            "author_flair_css_class": null,
            "downs": 0,
            "mod_reports": [],
            "saved": false,
            "is_self": true,
            "name": "t3_2i9f10",
            "permalink": "/r/Bitcoin/comments/2i9f10/citizens_of_earth_reclaim_your_sovereignty/",
            "stickied": false,
            "created": 1412436991,
            "url": "http://www.reddit.com/r/Bitcoin/comments/2i9f10/citizens_of_earth_reclaim_your_sovereignty/",
            "author_flair_text": null,
            "title": "Citizens of Earth, RECLAIM YOUR SOVEREIGNTY!",
            "created_utc": 1412408191,
            "ups": 0,
            "upvote_ratio": 0.5,
            "num_comments": 3,
            "visited": false,
            "num_reports": null,
            "distinguished": null
          }
        }
      ],
      "after": null,
      "before": null
    }
  },
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [
        {
          "kind": "t1",
          "data": {
            "subreddit_id": "t5_2s3qj",
            "banned_by": null,
            "link_id": "t3_2i9f10",
            "likes": null,
            "replies": "",
            "user_reports": [],
            "saved": false,
            "id": "cl02ist",
            "gilded": 0,
            "report_reasons": null,
            "author": "MineForeman",
            "parent_id": "t3_2i9f10",
            "score": 6,
            "approved_by": null,
            "controversiality": 0,
            "body": "Paragraphs?",
            "edited": false,
            "author_flair_css_class": null,
            "downs": 0,
            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Paragraphs?&lt;/p&gt;\n&lt;/div&gt;",
            "subreddit": "Bitcoin",
            "score_hidden": false,
            "name": "t1_cl02ist",
            "created": 1412437050,
            "author_flair_text": null,
            "created_utc": 1412408250,
            "distinguished": null,
            "mod_reports": [],
            "num_reports": null,
            "ups": 6
          }
        },
        {
          "kind": "t1",
          "data": {
            "subreddit_id": "t5_2s3qj",
            "banned_by": null,
            "link_id": "t3_2i9f10",
            "likes": null,
            "replies": "",
            "user_reports": [],
            "saved": false,
            "id": "cl0644r",
            "gilded": 0,
            "report_reasons": null,
            "author": "rufusthelawyer",
            "parent_id": "t3_2i9f10",
            "score": 1,
            "approved_by": null,
            "controversiality": 0,
            "body": "Aside from your sanity, how much have you lost on bitcoin?",
            "edited": false,
            "author_flair_css_class": null,
            "downs": 0,
            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Aside from your sanity, how much have you lost on bitcoin?&lt;/p&gt;\n&lt;/div&gt;",
            "subreddit": "Bitcoin",
            "score_hidden": false,
            "name": "t1_cl0644r",
            "created": 1412458161,
            "author_flair_text": null,
            "created_utc": 1412429361,
            "distinguished": null,
            "mod_reports": [],
            "num_reports": null,
            "ups": 1
          }
        },
        {
          "kind": "t1",
          "data": {
            "subreddit_id": "t5_2s3qj",
            "banned_by": null,
            "link_id": "t3_2i9f10",
            "likes": null,
            "replies": "",
            "user_reports": [],
            "saved": false,
            "id": "cl038n1",
            "gilded": 0,
            "report_reasons": null,
            "author": "unfit_bagel",
            "parent_id": "t3_2i9f10",
            "score": 0,
            "approved_by": null,
            "controversiality": 0,
            "body": "reclaim your meds",
            "edited": false,
            "author_flair_css_class": null,
            "downs": 0,
            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;reclaim your meds&lt;/p&gt;\n&lt;/div&gt;",
            "subreddit": "Bitcoin",
            "score_hidden": false,
            "name": "t1_cl038n1",
            "created": 1412441354,
            "author_flair_text": null,
            "created_utc": 1412412554,
            "distinguished": null,
            "mod_reports": [],
            "num_reports": null,
            "ups": 0
          }
        }
      ],
      "after": null,
      "before": null
    }
  }
]