[
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [
        {
          "kind": "t3",
          "data": {
            "domain": "self.Bitcoin",
            "banned_by": null,
            "media_embed": {},
            "subreddit": "Bitcoin",
            "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;IMHO, bitcoin will continue its downward slide, for the foreseeable future, given these possible reasons:&lt;/p&gt;\n\n&lt;p&gt;1) As miners continue to produce more bitcoins, the value of each individual cryptographic unit will decrease due to the realities of saturating the market with a larger supply. This is the law of inflation. &lt;/p&gt;\n\n&lt;p&gt;Not until all coins are mined will this cease to be an issue; this should occur around the year 2021.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;1a) There would have to be continual influxes of exceptional capital. This relates to increases in demand.&lt;/p&gt;\n\n&lt;p&gt;1b) Lost, missing, destroyed quantities of BTC equal or greater to the newly minted cryptographic units.&lt;/p&gt;\n\n&lt;p&gt;1c) The naturally occurring and inevitable halving should help to slow inflation. The next halving should occur August of 2016. As of this writing, current estimated totals of BTC is approaching the 13.5 million mark out of a total possible 21 million.&lt;/p&gt;\n\n&lt;p&gt;1d) The ever–inflating supply of fiat currency will contribute to a rise in value of BTC, however, it will largely be superficial and not a true increase in wealth. So long as the inflation of fiat is of a higher percentage than that of mining inflation, subjective gains will be noticed. Positively, bitcoin investment may prove to be a great hedge against inflation; better than a savings account, this seems reasonable to believe.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;2) As each bitcoin loses value, due to various reasons, miners will be obligated to sell any and all coins to maintain profits, and/or cover production costs.\nThis is a cycle that will feed itself until enough mining operations are forced to turn off their machines. If the algorithmic difficulty becomes too insurmountable, said difficulty will stall and allow for mining tools to become more advanced, inexpensive, and decentralized.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;2a) Simple, inexpensive means of promoting a decentralized network. The more nodes, the less money will be required to support the system. Needs to be sustainable even after all reward blocks are exhausted.&lt;/p&gt;\n\n&lt;p&gt;2b) Increased, overall adoption is needed to create a self–sustaining market. This will be known to have occurred when bitcoin is actually used like any other currency. The fact that BTC cannot currently be accepted for most transactions, if not all, demotes its financial status to that of a commodity. Miners need to be able to pay their business costs (mining equipment, employee salaries, utilities, rent, et cetera) with bitcoin. An insular BTC market is what all the big–name economies strive for, if they are smart and conscientious of the future. For example, it should be easy to bring wealth into the ecosystem but undesirable to convert wealth out; this will be accomplished through economic incentives but not fascist, regulatory schemes.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;3) Total or greater loss of demand might occur based on both rational and emotional reasons. Either the majority of adopters blind themselves, and others, to the brilliance of this technical innovation, only to suckle upon the vampiric teat of the fiat system once again, OR a better version of the blockchain technology out competes the BTC version.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;3a) Technology improvements to the BTC technology.&lt;/p&gt;\n\n&lt;p&gt;3b) Education and transparency on bitcoin information. Fear is a symptom of ignorance.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;4) Deflation in value could occur when more vendors integrate bitcoin payment gateways disproportionately, in excess, to the amount of new consumer adopters. More BTC will be converted to fiat than fiat into bitcoin. This has been discussed the most, in the community, from what I have had the opportunity to observe. An increase of services and business adoption is an important and positive step forward but it is creating sell–pressure.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;4a) Similar problem to what mining operations are facing. Companies like Overstock need a convenient and market refined way of paying their business expenses in bitcoin. For example, businesses need to be able to restock their wares using BTC. This entails that their suppliers are also able to accept BTC and pay their own expenses with the technology.&lt;/p&gt;\n\n&lt;p&gt;4b) Consumers need more incentives and applications that make using bitcoin, on a daily basis, reasonable and intuitive.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;5) There is a lack of wide–spread market adoption perpetuated by the bitcoin community as well as a combination of both vendor and consumer ignorance, fear, laziness, stupidity; this helps create market volatility, which is something that perpetuates the exact issue.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;5a) As adoption increases and BTC wealth is spread out among more hands, currency conversions will have significantly less impact. For example, the influence whales could exert will be far diminished; furthermore, a self–actualized bitcoin economy might dissuade any whales from rocking the boat. Fortunately, the inflation created from mining does help to reduce the size of whales.&lt;/p&gt;\n\n&lt;p&gt;5b) The current form of the cryptocurrency scene is not user–friendly, for the average man. It is not fun, it is not easy to use or understand. It is simple to lose wealth for unacceptable reasons such as client–side application bugs. Excuses are made for every conceivable weakness in the tech; there is a major blame the victim mentality. It is not okay, at this point, for someone to be asked to trust and invest significant sums of wealth in a buggy, &amp;quot;experimental&amp;quot; technology where educational transparency is at a minimum.\nToo many people, with bitcoin community influence, seem to have made too much money by investing at the right time. As a result, early adopters have been awarded large sums of play money for pocket change; not everyone can afford to make mistakes with bitcoin due to negligence on the part of developers (or whoever). Many investors, especially new adopters, are going to have to pony up much more for much less, with money earned through significantly longer/harder investments of labor. It is unacceptable for there not to be more security in place to safeguard this wealth influx. It is inconsiderate and disrespectful for there not to be.\nUsing BTC should be an experience that is rewarding, fun, easy, simple and stress–free. One can claim that it is good enough but I say, &amp;quot;good is the enemy of great.&amp;quot;\nI have a background in customer service relations, information architecture and graphic design. The situation is far from optimized imo; the basics of user experience need work. It is common for technical people to be dismissive of this aspect of reality, as it is some sort of badge of intelligence, however, this would be a very short–sighted and foolish arrogance to embrace right now, if not always.&lt;/p&gt;\n\n&lt;p&gt;5c) Better education with examples.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;6) Greed and market dilution.&lt;/p&gt;\n\n&lt;p&gt;To prevent this idea from having a significant effect on the market:&lt;/p&gt;\n\n&lt;p&gt;6a) There needs to be a change of focus away from getting rich quick off of cryptocurrency. Absolutely, people should be patient and ready to capitalize on opportunities but the focus should be on the evolution of the technology, which should make us all wealthier, in the long run. Let the greedy money come in but be aware that the other side of this coin is the quick, emotional, panic sells that lead to instability.&lt;/p&gt;\n\n&lt;p&gt;6b) Alternative currencies are spreading the current market capital too thin. Most of the coins are horse shit and we all know it; some altcoins have merit. In fact, I would be totally unfazed if an altcoin was named horseshit coin; it is that bad.\nIt should be clear, by now, that no one is getting &amp;quot;bitcoin rich&amp;quot; off of any of these forked BTC protocols. Their value is too closely synced to the tides of bitcoin market values, and if new adopters are unwilling to put their wealth in the most battle–hardened cryptocurrency, why in the world would anyone think that a sudden wave of significant treasure would come to bolster a less secure, basically unknown, random public ledger? It is unlikely, therefore, stop diluting the economy and focus on coins with merit. At this point, it doesnt matter if altcoin A boasts faster transaction times, or altcoin B has more than 21 million units, or altcoin C will be useful in tipping a woman for posting her three–thousandth, heavily edited selfie in order to raise her self–esteem. It is clear by now that the core demographic of cryptocurrency adopters do not care and therefore, my guess is that the rest of the world will not either (at least not until they accept BTC first). Redundant and asinine altcoins, created without purpose, only serve to hurt the overall market, confuse new adopters, and present this industry as a joke to entities that greatly matter.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;7) ?&lt;/p&gt;\n\n&lt;p&gt;What did I miss, or where am I completely wrong?&lt;/p&gt;\n\n&lt;p&gt;Let us discuss and thanks for reading and considering my ruminations.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;TL;DR/recap&lt;/p&gt;\n\n&lt;p&gt;1) Miners are causing inflation, which lowers value of individual coins.&lt;/p&gt;\n\n&lt;p&gt;Solution: Not enough incoming capital to offset.&lt;/p&gt;\n\n&lt;p&gt;2) Miners selling BTC, for fiat, to pay for mining expenses.&lt;/p&gt;\n\n&lt;p&gt;Solution: Need to be able to pay for everything in BTC in a well–developed, self-sustaining BTC economy.&lt;/p&gt;\n\n&lt;p&gt;3) Emotional and rational reasons turning people, and their wealth, away from BTC, towards an altcoin or back towards fiat.&lt;/p&gt;\n\n&lt;p&gt;Solution: Bitcoin technology and education surrounding the tech could be improved.&lt;/p&gt;\n\n&lt;p&gt;4) Increase in vendors accepting BTC but converting into fiat. Not enough fiat to BTC conversion as BTC to fiat conversion.&lt;/p&gt;\n\n&lt;p&gt;Solution: Businesses need to be able to pay their creditors with BTC. Fiat needs to be cut out of equation.&lt;/p&gt;\n\n&lt;p&gt;5) Not enough market acceptance leads to volatility.&lt;/p&gt;\n\n&lt;p&gt;Solution: More intuitive and experience driven tools to make using BTC a breeze.&lt;/p&gt;\n\n&lt;p&gt;6) Greed and alternative coins are diluting the wealth in the market.&lt;/p&gt;\n\n&lt;p&gt;Solution: A focus on the coins that matter with an emphasis on improving what already exists. If bitcoin is struggling to gain global support, there is little chance an unknown altcoin is going to somehow achieve this with a cute name.&lt;/p&gt;\n\n&lt;p&gt;7) Your and the rest of Reddit&amp;#39;s input!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
            "selftext": "IMHO, bitcoin will continue its downward slide, for the foreseeable future, given these possible reasons:\n\n1) As miners continue to produce more bitcoins, the value of each individual cryptographic unit will decrease due to the realities of saturating the market with a larger supply. This is the law of inflation. \n\nNot until all coins are mined will this cease to be an issue; this should occur around the year 2021.\n\nTo prevent this idea from having a significant effect on the market:\n\n1a) There would have to be continual influxes of exceptional capital. This relates to increases in demand.\n\n1b) Lost, missing, destroyed quantities of BTC equal or greater to the newly minted cryptographic units.\n\n1c) The naturally occurring and inevitable halving should help to slow inflation. The next halving should occur August of 2016. As of this writing, current estimated totals of BTC is approaching the 13.5 million mark out of a total possible 21 million.\n\n1d) The ever–inflating supply of fiat currency will contribute to a rise in value of BTC, however, it will largely be superficial and not a true increase in wealth. So long as the inflation of fiat is of a higher percentage than that of mining inflation, subjective gains will be noticed. Positively, bitcoin investment may prove to be a great hedge against inflation; better than a savings account, this seems reasonable to believe.\n\n________\n\n\n2) As each bitcoin loses value, due to various reasons, miners will be obligated to sell any and all coins to maintain profits, and/or cover production costs.\nThis is a cycle that will feed itself until enough mining operations are forced to turn off their machines. If the algorithmic difficulty becomes too insurmountable, said difficulty will stall and allow for mining tools to become more advanced, inexpensive, and decentralized.\n\nTo prevent this idea from having a significant effect on the market:\n\n2a) Simple, inexpensive means of promoting a decentralized network. The more nodes, the less money will be required to support the system. Needs to be sustainable even after all reward blocks are exhausted.\n\n2b) Increased, overall adoption is needed to create a self–sustaining market. This will be known to have occurred when bitcoin is actually used like any other currency. The fact that BTC cannot currently be accepted for most transactions, if not all, demotes its financial status to that of a commodity. Miners need to be able to pay their business costs (mining equipment, employee salaries, utilities, rent, et cetera) with bitcoin. An insular BTC market is what all the big–name economies strive for, if they are smart and conscientious of the future. For example, it should be easy to bring wealth into the ecosystem but undesirable to convert wealth out; this will be accomplished through economic incentives but not fascist, regulatory schemes.\n\n________\n\n\n3) Total or greater loss of demand might occur based on both rational and emotional reasons. Either the majority of adopters blind themselves, and others, to the brilliance of this technical innovation, only to suckle upon the vampiric teat of the fiat system once again, OR a better version of the blockchain technology out competes the BTC version.\n\nTo prevent this idea from having a significant effect on the market:\n\n3a) Technology improvements to the BTC technology.\n\n3b) Education and transparency on bitcoin information. Fear is a symptom of ignorance.\n\n________\n\n\n4) Deflation in value could occur when more vendors integrate bitcoin payment gateways disproportionately, in excess, to the amount of new consumer adopters. More BTC will be converted to fiat than fiat into bitcoin. This has been discussed the most, in the community, from what I have had the opportunity to observe. An increase of services and business adoption is an important and positive step forward but it is creating sell–pressure.\n\nTo prevent this idea from having a significant effect on the market:\n\n4a) Similar problem to what mining operations are facing. Companies like Overstock need a convenient and market refined way of paying their business expenses in bitcoin. For example, businesses need to be able to restock their wares using BTC. This entails that their suppliers are also able to accept BTC and pay their own expenses with the technology.\n\n4b) Consumers need more incentives and applications that make using bitcoin, on a daily basis, reasonable and intuitive.\n\n________\n\n\n5) There is a lack of wide–spread market adoption perpetuated by the bitcoin community as well as a combination of both vendor and consumer ignorance, fear, laziness, stupidity; this helps create market volatility, which is something that perpetuates the exact issue.\n\nTo prevent this idea from having a significant effect on the market:\n\n5a) As adoption increases and BTC wealth is spread out among more hands, currency conversions will have significantly less impact. For example, the influence whales could exert will be far diminished; furthermore, a self–actualized bitcoin economy might dissuade any whales from rocking the boat. Fortunately, the inflation created from mining does help to reduce the size of whales.\n\n5b) The current form of the cryptocurrency scene is not user–friendly, for the average man. It is not fun, it is not easy to use or understand. It is simple to lose wealth for unacceptable reasons such as client–side application bugs. Excuses are made for every conceivable weakness in the tech; there is a major blame the victim mentality. It is not okay, at this point, for someone to be asked to trust and invest significant sums of wealth in a buggy, \"experimental\" technology where educational transparency is at a minimum.\nToo many people, with bitcoin community influence, seem to have made too much money by investing at the right time. As a result, early adopters have been awarded large sums of play money for pocket change; not everyone can afford to make mistakes with bitcoin due to negligence on the part of developers (or whoever). Many investors, especially new adopters, are going to have to pony up much more for much less, with money earned through significantly longer/harder investments of labor. It is unacceptable for there not to be more security in place to safeguard this wealth influx. It is inconsiderate and disrespectful for there not to be.\nUsing BTC should be an experience that is rewarding, fun, easy, simple and stress–free. One can claim that it is good enough but I say, \"good is the enemy of great.\"\nI have a background in customer service relations, information architecture and graphic design. The situation is far from optimized imo; the basics of user experience need work. It is common for technical people to be dismissive of this aspect of reality, as it is some sort of badge of intelligence, however, this would be a very short–sighted and foolish arrogance to embrace right now, if not always.\n\n5c) Better education with examples.\n\n________\n\n\n6) Greed and market dilution.\n\nTo prevent this idea from having a significant effect on the market:\n\n6a) There needs to be a change of focus away from getting rich quick off of cryptocurrency. Absolutely, people should be patient and ready to capitalize on opportunities but the focus should be on the evolution of the technology, which should make us all wealthier, in the long run. Let the greedy money come in but be aware that the other side of this coin is the quick, emotional, panic sells that lead to instability.\n\n6b) Alternative currencies are spreading the current market capital too thin. Most of the coins are horse shit and we all know it; some altcoins have merit. In fact, I would be totally unfazed if an altcoin was named horseshit coin; it is that bad.\nIt should be clear, by now, that no one is getting \"bitcoin rich\" off of any of these forked BTC protocols. Their value is too closely synced to the tides of bitcoin market values, and if new adopters are unwilling to put their wealth in the most battle–hardened cryptocurrency, why in the world would anyone think that a sudden wave of significant treasure would come to bolster a less secure, basically unknown, random public ledger? It is unlikely, therefore, stop diluting the economy and focus on coins with merit. At this point, it doesnt matter if altcoin A boasts faster transaction times, or altcoin B has more than 21 million units, or altcoin C will be useful in tipping a woman for posting her three–thousandth, heavily edited selfie in order to raise her self–esteem. It is clear by now that the core demographic of cryptocurrency adopters do not care and therefore, my guess is that the rest of the world will not either (at least not until they accept BTC first). Redundant and asinine altcoins, created without purpose, only serve to hurt the overall market, confuse new adopters, and present this industry as a joke to entities that greatly matter.\n\n________\n\n\n7) ?\n\nWhat did I miss, or where am I completely wrong?\n\nLet us discuss and thanks for reading and considering my ruminations.\n\n\n________\n\n\nTL;DR/recap\n\n1) Miners are causing inflation, which lowers value of individual coins.\n\nSolution: Not enough incoming capital to offset.\n\n2) Miners selling BTC, for fiat, to pay for mining expenses.\n\nSolution: Need to be able to pay for everything in BTC in a well–developed, self-sustaining BTC economy.\n\n3) Emotional and rational reasons turning people, and their wealth, away from BTC, towards an altcoin or back towards fiat.\n\nSolution: Bitcoin technology and education surrounding the tech could be improved.\n\n4) Increase in vendors accepting BTC but converting into fiat. Not enough fiat to BTC conversion as BTC to fiat conversion.\n\nSolution: Businesses need to be able to pay their creditors with BTC. Fiat needs to be cut out of equation.\n\n5) Not enough market acceptance leads to volatility.\n\nSolution: More intuitive and experience driven tools to make using BTC a breeze.\n\n6) Greed and alternative coins are diluting the wealth in the market.\n\nSolution: A focus on the coins that matter with an emphasis on improving what already exists. If bitcoin is struggling to gain global support, there is little chance an unknown altcoin is going to somehow achieve this with a cute name.\n\n7) Your and the rest of Reddit's input!",
            "likes": null,
            "user_reports": [],
            "secure_media": null,
            "link_flair_text": null,
            "id": "2iiu2a",
            "gilded": 0,
            "secure_media_embed": {},
            "clicked": false,
            "report_reasons": null,
            "author": "darrenbrull",
            "media": null,
            "score": 2,
            "approved_by": null,
            "over_18": false,
            "hidden": false,
            "thumbnail": "self",
            "subreddit_id": "t5_2s3qj",
            "edited": false,
            "link_flair_css_class": null,
            "author_flair_css_class": null,
            "downs": 0,
            "mod_reports": [],
            "saved": false,
            "is_self": true,
            "name": "t3_2iiu2a",
            "permalink": "/r/Bitcoin/comments/2iiu2a/a_laymans_enumerated_thoughts_on_the_decreasing/",
            "stickied": false,
            "created": 1412681924,
            "url": "http://www.reddit.com/r/Bitcoin/comments/2iiu2a/a_laymans_enumerated_thoughts_on_the_decreasing/",
            "author_flair_text": null,
            "title": "A layman's enumerated thoughts on the decreasing value of BTC.",
            "created_utc": 1412653124,
            "ups": 2,
            "upvote_ratio": 0.76,
            "num_comments": 0,
            "visited": false,
            "num_reports": null,
            "distinguished": null
          }
        }
      ],
      "after": null,
      "before": null
    }
  },
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [],
      "after": null,
      "before": null
    }
  }
]