[
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [
        {
          "kind": "t3",
          "data": {
            "domain": "self.Bitcoin",
            "banned_by": null,
            "media_embed": {},
            "subreddit": "Bitcoin",
            "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Let&amp;#39;s say a subreddit wants to reward one of their favorite people, or a celebrity who&amp;#39;s done something cool, anything like that.&lt;/p&gt;\n\n&lt;p&gt;The person places the order for the pizza (let&amp;#39;s say) and after checking out it shows a QR code and BTC address: &amp;quot;You have X minutes to send $15.11 worth of Bitcoin to the following address, if funds are not received within X minutes this order will be canceled and received funds will be given to [a deserving charity / the dev fund / whatever ] - if full funds are received, this order will complete&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The person posts their link: &amp;quot;hey guys here&amp;#39;s my pizza btc addy, thanks in advance that is so awesome of you to offer!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;The community pitches in, some people fifty cents, others a dollar and the order fulfills.&lt;/p&gt;\n\n&lt;p&gt;I could see this being huge with so many niches online it&amp;#39;s ridiculous. Online porn stars (this would be cooler than Amazon wish lists, more immediate and useful), people in need, when a friend is down someone can post on Facebook something you&amp;#39;ve bought for them and get all your friends or that person&amp;#39;s family members to pitch in a bit and make it happen.&lt;/p&gt;\n\n&lt;p&gt;I think we make Bitcoin that gazillion dollar &amp;quot;better than currency&amp;quot; Bill Gates fantasy land when we stop trying to simply follow Visa&amp;#39;s and PayPal&amp;#39;s footsteps, and instead keep thinking of ways we can do money that no other money &lt;em&gt;can&lt;/em&gt; do. Internet native allows us to do a lot, and crowdfunding can be completely redefined to be a semiprivate activity amongst friends and peers (as most social networks are used) instead of a 100% public marketed activity (stuff like Kickstarter).&lt;/p&gt;\n\n&lt;p&gt;Not going to post an address here and solicit, but if anyone likes the idea enough and wants to throw down some coin, I can onboard a dev/marketing team and get this idea together fairly quick. I&amp;#39;m thinking a &lt;a href=\"http://changetip.com\"&gt;changetip&lt;/a&gt; approach here - go for many platforms all at once, make it easy to share your order along your existing social media accounts and via email, and keep in contact with users. When a natural disaster hits or a celebrity has a really cool project, maybe send out an email so the whole community can go crazy and make it happen. Or possibly better, we could convince coinbase and bitpay to offer this service. Seems easy to implement.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
            "selftext": "Let's say a subreddit wants to reward one of their favorite people, or a celebrity who's done something cool, anything like that.\n\nThe person places the order for the pizza (let's say) and after checking out it shows a QR code and BTC address: \"You have X minutes to send $15.11 worth of Bitcoin to the following address, if funds are not received within X minutes this order will be canceled and received funds will be given to [a deserving charity / the dev fund / whatever ] - if full funds are received, this order will complete\"\n\nThe person posts their link: \"hey guys here's my pizza btc addy, thanks in advance that is so awesome of you to offer!\"\n\nThe community pitches in, some people fifty cents, others a dollar and the order fulfills.\n\nI could see this being huge with so many niches online it's ridiculous. Online porn stars (this would be cooler than Amazon wish lists, more immediate and useful), people in need, when a friend is down someone can post on Facebook something you've bought for them and get all your friends or that person's family members to pitch in a bit and make it happen.\n\nI think we make Bitcoin that gazillion dollar \"better than currency\" Bill Gates fantasy land when we stop trying to simply follow Visa's and PayPal's footsteps, and instead keep thinking of ways we can do money that no other money *can* do. Internet native allows us to do a lot, and crowdfunding can be completely redefined to be a semiprivate activity amongst friends and peers (as most social networks are used) instead of a 100% public marketed activity (stuff like Kickstarter).\n\nNot going to post an address here and solicit, but if anyone likes the idea enough and wants to throw down some coin, I can onboard a dev/marketing team and get this idea together fairly quick. I'm thinking a [changetip](http://changetip.com) approach here - go for many platforms all at once, make it easy to share your order along your existing social media accounts and via email, and keep in contact with users. When a natural disaster hits or a celebrity has a really cool project, maybe send out an email so the whole community can go crazy and make it happen. Or possibly better, we could convince coinbase and bitpay to offer this service. Seems easy to implement.",
            "likes": null,
            "user_reports": [],
            "secure_media": null,
            "link_flair_text": null,
            "id": "2i7xqj",
            "gilded": 0,
            "secure_media_embed": {},
            "clicked": false,
            "report_reasons": null,
            "author": "CryptoDonDraper",
            "media": null,
            "score": 2,
            "approved_by": null,
            "over_18": false,
            "hidden": false,
            "thumbnail": "self",
            "subreddit_id": "t5_2s3qj",
            "edited": 1412368313,
            "link_flair_css_class": null,
            "author_flair_css_class": null,
            "downs": 0,
            "mod_reports": [],
            "saved": false,
            "is_self": true,
            "name": "t3_2i7xqj",
            "permalink": "/r/Bitcoin/comments/2i7xqj/next_billion_dollar_use_case_embeddable_widget/",
            "stickied": false,
            "created": 1412396869,
            "url": "http://www.reddit.com/r/Bitcoin/comments/2i7xqj/next_billion_dollar_use_case_embeddable_widget/",
            "author_flair_text": null,
            "title": "Next billion dollar use case: embeddable widget that allows for qr code crowdfunding of the shopping cart amount due before the order fulfills... Think about it.",
            "created_utc": 1412368069,
            "ups": 2,
            "upvote_ratio": 0.58,
            "num_comments": 1,
            "visited": false,
            "num_reports": null,
            "distinguished": null
          }
        }
      ],
      "after": null,
      "before": null
    }
  },
  {
    "kind": "Listing",
    "data": {
      "modhash": "",
      "children": [
        {
          "kind": "t1",
          "data": {
            "subreddit_id": "t5_2s3qj",
            "banned_by": null,
            "link_id": "t3_2i7xqj",
            "likes": null,
            "replies": "",
            "user_reports": [],
            "saved": false,
            "id": "ckzp3sy",
            "gilded": 0,
            "report_reasons": null,
            "author": "rufusthelawyer",
            "parent_id": "t3_2i7xqj",
            "score": 1,
            "approved_by": null,
            "controversiality": 0,
            "body": "So... an escrow?",
            "edited": false,
            "author_flair_css_class": null,
            "downs": 0,
            "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So... an escrow?&lt;/p&gt;\n&lt;/div&gt;",
            "subreddit": "Bitcoin",
            "score_hidden": false,
            "name": "t1_ckzp3sy",
            "created": 1412398527,
            "author_flair_text": null,
            "created_utc": 1412369727,
            "distinguished": null,
            "mod_reports": [],
            "num_reports": null,
            "ups": 1
          }
        }
      ],
      "after": null,
      "before": null
    }
  }
]